app/views/jobs/_form.html.haml

= simple_form_for(@job, html: { class: "form-horizontal"}) do |f|
	= f.collection_select :category_id, Category.all, :id, :name, {promt: "Choose a category" }, input_html: { class: "dropdown-toggle" }
---
SELECT "categories".* FROM "categories"